oskarbjo/NRF52/ble_transmit_SPI/pca10056/s140/ses/main.c
//            bytes_cnt += p_evt->params.hvx.notif_len;
//            ////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//            ////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//            // My edit: Get the pointer to the received data the length of which is p_evt->params.hvx.notif_len
//            uint8_t * p_received_data = p_evt->p_rcv_data;
//            if(!doPrint){
//              for(int i=0;i<p_evt->params.hvx.notif_len;i++){
//              NRF_LOG_INFO("Data received:, %d",p_received_data[i]);
//              }
//              doPrint=true;
//            }
//            ////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//            ////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//            if (bytes_cnt > 1024)
//            {
//                bsp_board_led_invert(PROGRESS_LED);

//                bytes_cnt -= 1024;
//                kbytes_cnt++;

//                NRF_LOG_INFO("Received %u kbytes", kbytes_cnt);

//                nrf_ble_amts_rbc_set(&m_amts, p_evt->params.hvx.bytes_rcvd);
//            }

//            //if (p_evt->params.hvx.bytes_rcvd >= AMT_BYTE_TRANSFER_CNT)
//            //{
//            //    bsp_board_led_off(PROGRESS_LED);

//            //    bytes_cnt  = 0;
//            //    kbytes_cnt = 0;

//            //    //NRF_LOG_INFO("Transfer complete, received %u bytes of ATT payload.",
//            //                 p_evt->params.hvx.bytes_rcvd);

//            //    nrf_ble_amts_rbc_set(&m_amts, p_evt->params.hvx.bytes_rcvd);
//            //}
//        } break;

//        case NRF_BLE_AMT_C_EVT_RBC_READ_RSP:
//        {
//            NRF_LOG_INFO("Peer received %u bytes of ATT payload.", (p_evt->params.rcv_bytes_cnt));
//            //test_terminate();
//        } break;

//        default:
//            break;
//    }
//}


/**@brief Function for handling database discovery events.
 *
 * @details This function is a callback function to handle events from the database discovery module.
 *          Depending on the UUIDs that are discovered, this function forwards the events
 *          to their respective service instances.
 *
 * @param[in] p_evt  Pointer to the database discovery event.
 */
//static void db_disc_evt_handler(ble_db_discovery_evt_t * p_evt)
//{
//    //nrf_ble_amtc_on_db_disc_evt(&m_amtc, p_evt);
//}


/**@brief Function for handling events from the GATT library. */
static void gatt_evt_handler(nrf_ble_gatt_t * p_gatt, nrf_ble_gatt_evt_t const * p_evt)
{
    switch (p_evt->evt_id)
    {
        case NRF_BLE_GATT_EVT_ATT_MTU_UPDATED:
        {
            m_mtu_exchanged = true;
            NRF_LOG_INFO("ATT MTU exchange completed. MTU set to %u bytes.",
                         p_evt->params.att_mtu_effective);
        } break;

        case NRF_BLE_GATT_EVT_DATA_LENGTH_UPDATED:
        {
            m_data_length_updated = true;
            NRF_LOG_INFO("Data length updated to %u bytes.", p_evt->params.data_length);
        } break;
    }

    nrf_ble_amts_on_gatt_evt(&m_amts, p_evt);
}


/**@brief Function for setting up advertising data. */
static void advertising_data_set(void)
{
    ret_code_t ret;

    ble_gap_adv_params_t const adv_params =
    {
        .properties    =
        {
          .type = BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED,
        },
        .p_peer_addr   = NULL,
        .filter_policy = BLE_GAP_ADV_FP_ANY,
        .interval      = ADV_INTERVAL,
        .duration      = 0,

        .primary_phy   = BLE_GAP_PHY_1MBPS, // Must be changed to connect in long range. (BLE_GAP_PHY_CODED)
        .secondary_phy = BLE_GAP_PHY_2MBPS,
    };

    ble_advdata_t const adv_data =
    {
        .name_type          = BLE_ADVDATA_FULL_NAME,
        .flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE,
        .include_appearance = false,
    };

    ret = ble_advdata_encode(&adv_data, m_adv_data.adv_data.p_data, &m_adv_data.adv_data.len);
    APP_ERROR_CHECK(ret);

    ret = sd_ble_gap_adv_set_configure(&m_adv_handle, &m_adv_data, &adv_params);
    APP_ERROR_CHECK(ret);
}


/**@brief Function for starting advertising. */
static void advertising_start(void)
{
    NRF_LOG_INFO("Starting advertising.");

    bsp_board_led_on(SCAN_ADV_LED);

    UNUSED_RETURN_VALUE(sd_ble_gap_adv_stop(m_adv_handle));

    ret_code_t err_code = sd_ble_gap_adv_start(m_adv_handle, APP_BLE_CONN_CFG_TAG);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Scanning Module events.
 */
//static void scan_evt_handler(scan_evt_t const * p_scan_evt)
//{
//    ret_code_t                       err_code;
//    ble_gap_evt_adv_report_t const * p_adv = 
//                   p_scan_evt->params.filter_match.p_adv_report;
//    ble_gap_scan_params_t    const * p_scan_param = 
//                   p_scan_evt->p_scan_params;

//    switch(p_scan_evt->scan_evt_id)
//    {
//        case NRF_BLE_SCAN_EVT_FILTER_MATCH:
//        {
//             NRF_LOG_INFO("Device \"%s\" found, sending a connection request.",
//             (uint32_t) m_target_periph_name);

//            // Stop advertising.
//            err_code = sd_ble_gap_adv_stop(m_adv_handle);
//            if (err_code != NRF_ERROR_INVALID_STATE)
//            {
//                APP_ERROR_CHECK(err_code);
//            }

//            // Initiate connection.
//            m_conn_param.min_conn_interval = CONN_INTERVAL_DEFAULT;
//            m_conn_param.max_conn_interval = CONN_INTERVAL_DEFAULT;

//            err_code = sd_ble_gap_connect(&p_adv->peer_addr,
//                                          p_scan_param,
//                                          &m_conn_param,
//                                          APP_BLE_CONN_CFG_TAG);

//            if (err_code != NRF_SUCCESS)
//            {
//                NRF_LOG_ERROR("sd_ble_gap_connect() failed: 0x%x.", err_code);
//            }
//        } break;

//        default:
//            break;
//     }
//}


/**@brief Function for initialization the scanning and setting the filters.
 */
//static void scan_init(void)
//{
//    ret_code_t err_code;

//    err_code = nrf_ble_scan_init(&m_scan, NULL, scan_evt_handler);
//    APP_ERROR_CHECK(err_code);

//    err_code = nrf_ble_scan_filter_set(&m_scan, 
//                                       SCAN_NAME_FILTER, 
//                                       m_target_periph_name);
//    APP_ERROR_CHECK(err_code);

