oskarbjo/NRF52/ble_transmit_SPI/pca10056/s140/ses/main.c
    uint32_t err_code = NRF_SUCCESS;

    //NRF_LOG_INFO("Sending data...");
    err_code = sd_ble_gatts_hvx(p_ctx->conn_handle, &hvx_param);

    if (err_code == NRF_ERROR_RESOURCES)
    {
        // Wait for BLE_GATTS_EVT_HVN_TX_COMPLETE.
        p_ctx->busy = true;
    }
    else if (err_code != NRF_SUCCESS)
    {
        NRF_LOG_ERROR("sd_ble_gatts_hvx() failed: 0x%x", err_code);
        return;
    }
    NRF_LOG_INFO("Data successfully transmitted");


}


void readAccelerometer(){
           //nrf_drv_spi_transfer(&spi, m_tx_buf2, 1, m_rx_buf, 2);
          nrf_drv_spi_transfer(&spi, m_tx_buf_ACC,7, m_rx_buf_ACC,7);
          while(!spi_xfer_done){}
          spi_xfer_done=false;
          for(int i=0;i<6;i++){
            output_buffer[i] = m_rx_buf_ACC[i+1];
          }

}


bool newAccDataAvailable(){
   bool dataIsAvailable = false;

   nrf_drv_spi_transfer(&spi, m_tx_buf0, 1, m_rx_buf, 2);
   while(!spi_xfer_done){}
   spi_xfer_done=false;
   if((m_rx_buf[1] & 0x01) == 0x01){
      dataIsAvailable=true;
   }
   return dataIsAvailable;

}


int main(void)
{
    // Initialize.

    log_init();

    cli_init();
    leds_init();
    timer_init();
    counter_init();
    buttons_init();
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    advertising_data_set();
    //scan_init();

    server_init();
    //client_init();

    gatt_mtu_set(m_test_params.att_mtu);
    conn_evt_len_ext_set(m_test_params.conn_evt_len_ext_enabled);
    
    //SPI init:
    nrf_drv_spi_config_t spi_config = NRF_DRV_SPI_DEFAULT_CONFIG;
    spi_config.ss_pin   = SPI_SS_PIN;
    spi_config.miso_pin = SPI_MISO_PIN;
    spi_config.mosi_pin = SPI_MOSI_PIN;
    spi_config.sck_pin  = SPI_SCK_PIN;
    spi_config.mode = NRF_DRV_SPI_MODE_0;
    spi_config.frequency = NRF_DRV_SPI_FREQ_2M; //2147483648 = 8MHz
    APP_ERROR_CHECK(nrf_drv_spi_init(&spi, &spi_config, spi_event_handler, NULL));
    // Start execution.
    cli_start();

    buttons_enable();

    //Write SPI settings to IMU chip:
    nrf_drv_spi_transfer(&spi, m_tx_buf1, 2, m_rx_buf1, 2);
    while(!spi_xfer_done){}
    spi_xfer_done=false;


    NRF_LOG_INFO("ATT MTU example started.");
    NRF_LOG_INFO("Press button 3 on the board connected to the PC.");
    NRF_LOG_INFO("Press button 4 on other board.");
    uint32_t volatile delay_us = 1000000;
    int i = 0;
    int j = 0;
    m_run_test = false;


    // Enter main loop.
    for (;;)
    {

      
      idle_state_handle();
      nrf_delay_us(delay_us);
      //readAccelerometer();
      if(newAccDataAvailable()){
          readAccelerometer();
          if (is_test_ready())
          {   
              //SPI stuff
              send_SPI_RX_buf(&m_amts);
            
          }
      }
      j++;
    }
}


/**
 * @}
 */
